'use client';
import AccordionList from '@/app/components/ui/AccordionList/AccordionList';
import styles from './FaqList.module.css';

const FaqList = () => {
  return (
    <section className='relative flex flex-col items-center  bg-white mt-[122px] mb-[134px] z-[10]'>
      <AccordionList
        title='Загальні питання'
        items={[
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
        ]}
      />
      <AccordionList
        title='Поширені питання'
        titleClassName={styles.title}
        items={[
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
          {
            question:
              'Для яких типів дронів найкраще підходить польотний стек KARMA F405 V1?',
            answer:
              'Ідеально підходить для мікро- та невеликих FPV-дронів, а також для легких 3-дюймових або деяких 4-дюймових квадрокоптерів.',
          },
        ]}
      />
    </section>
  );
};

export default FaqList;
